Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2064DAL176.PIC
      <edc:SFRDef edc:_addr="0x1F8608B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNFJ" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNFJ" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFJ0" edc:mask="0x1" edc:name="CNFJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ1" edc:mask="0x1" edc:name="CNFJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ2" edc:mask="0x1" edc:name="CNFJ2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ3" edc:mask="0x1" edc:name="CNFJ3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ4" edc:mask="0x1" edc:name="CNFJ4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ5" edc:mask="0x1" edc:name="CNFJ5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ6" edc:mask="0x1" edc:name="CNFJ6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ7" edc:mask="0x1" edc:name="CNFJ7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ8" edc:mask="0x1" edc:name="CNFJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ9" edc:mask="0x1" edc:name="CNFJ9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ10" edc:mask="0x1" edc:name="CNFJ10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ11" edc:mask="0x1" edc:name="CNFJ11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ12" edc:mask="0x1" edc:name="CNFJ12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ13" edc:mask="0x1" edc:name="CNFJ13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ14" edc:mask="0x1" edc:name="CNFJ14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFJ15" edc:mask="0x1" edc:name="CNFJ15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8608C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SRCON0J" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SRCON0J" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0J0" edc:mask="0x1" edc:name="SR0J0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0J1" edc:mask="0x1" edc:name="SR0J1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J2" edc:mask="0x1" edc:name="SR0J2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J3" edc:mask="0x1" edc:name="SR0J3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J4" edc:mask="0x1" edc:name="SR0J4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J5" edc:mask="0x1" edc:name="SR0J5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J6" edc:mask="0x1" edc:name="SR0J6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J7" edc:mask="0x1" edc:name="SR0J7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J8" edc:mask="0x1" edc:name="SR0J8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J9" edc:mask="0x1" edc:name="SR0J9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J10" edc:mask="0x1" edc:name="SR0J10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J11" edc:mask="0x1" edc:name="SR0J11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J12" edc:mask="0x1" edc:name="SR0J12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J13" edc:mask="0x1" edc:name="SR0J13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J14" edc:mask="0x1" edc:name="SR0J14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0J15" edc:mask="0x1" edc:name="SR0J15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8608D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="SRCON1J" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="SRCON1J" edc:nzwidth="32" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1J0" edc:mask="0x1" edc:name="SR1J0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J1" edc:mask="0x1" edc:name="SR1J1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J2" edc:mask="0x1" edc:name="SR1J2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J3" edc:mask="0x1" edc:name="SR1J3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J4" edc:mask="0x1" edc:name="SR1J4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J5" edc:mask="0x1" edc:name="SR1J5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J6" edc:mask="0x1" edc:name="SR1J6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J7" edc:mask="0x1" edc:name="SR1J7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J8" edc:mask="0x1" edc:name="SR1J8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J9" edc:mask="0x1" edc:name="SR1J9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J10" edc:mask="0x1" edc:name="SR1J10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J11" edc:mask="0x1" edc:name="SR1J11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J12" edc:mask="0x1" edc:name="SR1J12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J13" edc:mask="0x1" edc:name="SR1J13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J14" edc:mask="0x1" edc:name="SR1J14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1J15" edc:mask="0x1" edc:name="SR1J15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8608E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860900" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="10" edc:access="-----------------------------nn-" edc:cname="ANSELK" edc:desc="" edc:grp="PORTK" edc:impl="0xffff0006" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------------11-" edc:name="ANSELK" edc:nzwidth="0x20" edc:por="-----------------------------11-" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSK1" edc:desc="" edc:mask="0x1" edc:name="ANSK1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSK2" edc:desc="" edc:mask="0x1" edc:name="ANSK2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
