Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2064DAL176.PIC
      <edc:AdjustPoint edc:_addr="0x1F8F9874" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8F9878" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="105" edc:access="----------------------------nnnn" edc:cname="SBT6WR1" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT6WR1" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f900000" edc:endaddr="0x1f910000" edc:kseg1="0xa0000000" edc:regionid="periph_ssx1">
      <edc:AdjustPoint edc:_addr="0x1F900000" edc:offset="1296"/>
      <edc:SFRDef edc:_addr="0x1F900510" edc:_begin="0x4" edc:_end="0x8" edc:_modsrc="DOS-EIP-00136_WACB_ssx_v1.Module" edc:_refcount="2" edc:access="-------------------------rrrrrrr" edc:cname="SBFLAG1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------0000000" edc:name="SBFLAG1" edc:nzwidth="32" edc:por="-------------------------0000000" ltx:baseofperipheral="SB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="T7PGV" edc:desc="" edc:mask="0x1" edc:name="T7PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8PGV" edc:desc="" edc:mask="0x1" edc:name="T8PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9PGV" edc:desc="" edc:mask="0x1" edc:name="T9PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T10PGV" edc:desc="" edc:mask="0x1" edc:name="T10PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T11PGV" edc:desc="" edc:mask="0x1" edc:name="T11PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T12PGV" edc:desc="" edc:mask="0x1" edc:name="T12PGV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T0PGV1" edc:desc="" edc:mask="0x1" edc:name="T0PGV1" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F900514" edc:offset="32524"/>
      <edc:SFRDef edc:_addr="0x1F908420" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="106" edc:access="C---CCCC--------rrrrrrrrrrrr-rrr" edc:cname="SBT7ELOG1" edc:desc="" edc:impl="0x8f00fff7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0---0000--------000000000000-000" edc:name="SBT7ELOG1" edc:nzwidth="32" edc:por="0---0000--------000000000000-000" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="" edc:mask="0x7" edc:name="CMD" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="" edc:mask="0xf" edc:name="REGION" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="INITID" edc:desc="" edc:mask="0xff" edc:name="INITID" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="CODE" edc:desc="" edc:mask="0xf" edc:name="CODE" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="MULTI" edc:desc="" edc:mask="0x1" edc:name="MULTI" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F908424" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="106" edc:access="------------------------------rr" edc:cname="SBT7ELOG2" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SBT7ELOG2" edc:nzwidth="32" edc:por="------------------------------00" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP" edc:desc="" edc:mask="0x3" edc:name="GROUP" edc:nzwidth="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F908428" edc:_begin="0x4" edc:_end="0x10" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="106" edc:access="-------n------------------------" edc:cname="SBT7ECON" edc:desc="" edc:impl="0x1000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0------------------------" edc:name="SBT7ECON" edc:nzwidth="32" edc:por="-------0------------------------" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="ERRP" edc:desc="" edc:mask="0x1" edc:name="ERRP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F90842C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F908430" edc:_begin="0x10" edc:_end="0x14" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="107" edc:access="-------------------------------r" edc:cname="SBT7ECLRS" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT7ECLRS" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F908434" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F908438" edc:_begin="0x14" edc:_end="0x18" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="108" edc:access="-------------------------------r" edc:cname="SBT7ECLRM" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------------------0" edc:name="SBT7ECLRM" edc:nzwidth="32" edc:por="-------------------------------0" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CLEAR" edc:desc="" edc:mask="0x1" edc:name="CLEAR" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
